/*!40101 SET NAMES utf8mb4 */;

DROP DATABASE IF EXISTS ltss_db_test;
CREATE DATABASE ltss_db_test;
use ltss_db_test;

CREATE TABLE user(
    uid INT AUTO_INCREMENT, 
    email VARCHAR(128) NOT NULL, 
    pwd VARCHAR(128) NOT NULL, 
    PRIMARY KEY (uid)
);

CREATE TABLE driver(
    did INT AUTO_INCREMENT, 
    name VARCHAR(32),
    adress VARCHAR(128), 
    lpnum VARCHAR(8) UNIQUE, 
    contact VARCHAR(11), 
    lat VARCHAR(17),
    lon VARCHAR(17), 
    uid INT NOT NULL, 
    PRIMARY KEY (did), 
    FOREIGN KEY (uid) REFERENCES user(uid) ON DELETE CASCADE
);

CREATE TABLE task(
    tid INT AUTO_INCREMENT,
    base_date DATE,
    dep_name VARCHAR(128) NOT NULL,
    dep_address VARCHAR(128), 
    dest_name VARCHAR(128) NOT NULL, 
    dest_address VARCHAR(128),
    dep_time_min INT, 
    dep_time_max INT, 
    dest_time_min INT, 
    dest_time_max INT, 
    dep_lat VARCHAR(17), 
    dep_lon VARCHAR(17), 
    dest_lat VARCHAR(17), 
    dest_lon VARCHAR(17), 
    did INT,
    sequence INT,
    t_time INT, 
    r_date TIMESTAMP DEFAULT CURRENT_TIMESTAMP,
    uid INT NOT NULL, 
    PRIMARY KEY (tid), 
    FOREIGN KEY (uid) 
    REFERENCES user(uid) ON DELETE CASCADE
);


CREATE TABLE place(
    pid INT AUTO_INCREMENT, 
    name VARCHAR(128), 
    adress VARCHAR(128),
    lon VARCHAR(17) NOT NULL, 
    lat VARCHAR(17) NOT NULL, 
    count INT DEFAULT 0,
    PRIMARY KEY (pid)
);

INSERT INTO user (email, pwd) VALUES ('test@test.com', '$2b$10$5cwlCGjb.uQZ8CS1xcf6JOh2ZOAqzhVQcnRVicpbIhx4QFZLa6emK');

INSERT INTO place (name, adress, lon, lat) VALUES 
('평택서부두', '경기 평택시 포승읍 신영리 671', '126.885935193061', '36.9390447587094'),
('인천2부두', '인천 중구 항동7가 1-33', '126.627288990714', '37.4626643817422'),
('인천대한제분', '인천 중구 북성동1가 4', '126.615780440948', '37.4789213031288'),
('음성피그넷', '충북 음성군 금왕읍 오선리 218-3', '127.563147905719', '36.9795239385309'),
('광양제일로지스', '전남 광양시 도이동 852', '127.668536364038', '34.91498191067057'),
('용인한일사료', '경기 용인시 기흥구 하갈동 213', '127.099061572871', '37.259340653753'),
('생극오뚜기제유', '충북 음성군 생극면 병암리 771', '127.60636371066957', '37.02153784093465');

INSERT INTO driver (lpnum, lon, lat, uid) VALUES 
('5847', '127.68384335535283', '34.92266657442493', 1),
-- ('6258', '127.69337542017766', '34.74925824566878', 1),
-- ('6337', '126.38192822336427', '34.80288226756954', 1),
('6374', '126.76037602514754', '35.01824284064417', 1),
-- ('6377', '129.06873512270215', '35.12385670818628', 1),
-- ('6434', '129.07120670265041', '35.11837144575708', 1),
-- ('6482', '129.0546604665966', '35.11984270319406', 1),
('6491', '129.3585933005933', '35.58865202117519', 1),
-- ('6508', '129.49288742810268', '35.76131981320343', 1),
('6515', '129.2344110182812', '35.82861021791112', 1),
-- ('6521', '129.4024092901574', '36.01018050034525', 1),
('6522', '127.52894168176515', '36.609257781329745', 1),
-- ('6524', '127.54178887877448', '36.707242208063505', 1),
('6528', '126.63378388580522', '36.88640324618445', 1),
-- ('6561', '127.11717627134432', '36.8537492352596', 1),
-- ('6569', '127.10217270165664', '37.03830635171048', 1),
('6587', '126.85193797900745', '37.215298677015596', 1),
-- ('6607', '126.61219531930351', '37.44282427273637', 1),
-- ('6651', '127.32005832365458', '37.381505779198115', 1),
('6682', '127.91071370153296', '37.70912415596021', 1),
('6695', '128.99032476133982', '37.735530984782095', 1);

INSERT INTO task (dep_name, dep_adress, dep_lon, dep_lat, 
dest_name, dest_adress, dest_lon, dest_lat, 
dep_time_min, dep_time_max, dest_time_min, dest_time_max, base_date, uid) VALUES
('안산수원축협사료', '경기 안산시 단원구 성곡동 670-2', '126.74031062616153', '37.31730242631212', 
'평택축협티엠알', '경기 평택시 청북읍 백봉리 247-1', '126.9943272', '37.0266816',
480, 1050, 540, 1050, '2024-05-02', 1),
('광양평창무역', '전남 광양시 황금동 산 191', '127.615413041328', '34.9137392205692',
'평택축협티엠알', '경기 평택시 청북읍 백봉리 247-1', '126.9943272', '37.0266816',
540, 1050, 1980, 2490, '2024-05-02', 1),
('평택중앙부두', '충남 당진시 신평면 매산리 976-4', '126.82502589796279', '36.95459553359399', 
'청주티엠알', '충북 청주시 청원구 오창읍 가좌리 70-5', '127.36853451642455', '36.72710027997984',
510, 1050, 1980, 2490, '2024-05-02', 1),
('광양트레바이오창고', '전라남도 광양시 항만7로 19', '127.6693633', '34.9156026', 
'옥천체리부로', '충청북도 옥천군 삼청2길 48-1', '127.5748127', '36.2786548',
540, 1050, 540, 1050, '2024-05-02', 1),
('군산대한통운5부두', '전북특별자치도 군산시 소룡동 1582-4', '126.5904638', '35.9753005',
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856', 
510, 1050, 540, 700, '2024-05-02', 1),
('군산대한통운5부두', '전북특별자치도 군산시 소룡동 1582-4', '126.5904638', '35.9753005', 
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
510, 1050, 540, 1020, '2024-05-02', 1),
('군산대한통운5부두', '전북특별자치도 군산시 소룡동 1582-4', '126.5904638', '35.9753005',
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
510, 1050, 540, 1800, '2024-05-02', 1),
('광양제일로지스', '전남 광양시 도이동 852', '127.6682945462448', '34.91552406560455',
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 540, 720, '2024-05-02', 1),
('광양제일로지스', '전남 광양시 도이동 852', '127.6682945462448', '34.91552406560455',
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 540, 1860, '2024-05-02', 1),
('인천선광싸이로', '인천 중구 항동7가 34-2', '126.62050694998639', '37.45529868705274',
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 540, 1260, '2024-05-02', 1),
('광양제일로지스', '전남 광양시 도이동 852', '127.6682945462448', '34.91552406560455', 
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 540, 780, '2024-05-02', 1),
('광양제일로지스', '전남 광양시 도이동 852', '127.6682945462448', '34.91552406560455', 
'나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 540, 1920, '2024-05-02', 1),
('광양트레바이오창고', '전라남도 광양시 항만7로 19', '127.6693633', '34.9156026',
'용인한일사료', '경기 용인시 기흥구 하갈동 213', '127.099061572871', '37.259340653753',
540, 1050, 540, 1050, '2024-05-02', 1),
-- ('나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
-- '진안무진장축협섬유질', '전북특별자치도 진안군 진안읍 연장리 1689', '127.3960065', '35.7757063',
-- 1260, 1980, 1980, 2490, '2024-05-02', 1),
-- ('나주우등TMR', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
-- '영암광주축협', '전남 영암군 삼호읍 난전리 1714-2', '126.43725658477692', '34.75139223091663',
-- 1380, 1980, 1980, 2490, '2024-05-02', 1),
('생극오뚜기제유', '충북 음성군 생극면 병암리 771', '127.60636371066957', '37.02153784093465', 
'진천풍림푸드', '충북 진천군 이월면 노원리 14-1', '127.433745530705', '36.9020225368336',
720, 1050, 540, 1050, '2024-05-02', 1),
('부평인그리디언', '인천 부평구 십정동 237', '126.68919385477419', '37.47600172399201', 
'양주의양티엠알', '경기 양주시 은현면 용암리 552-4', '126.7087158', '34.9261856',
900, 1050, 540, 1980, '2024-05-02', 1),
('광양제일로지스', '전남 광양시 도이동 852', '127.6682945462448', '34.91552406560455', 
'인천씨제이', '전라남도 나주시 세지면 예향로 3004-16', '126.7087158', '34.9261856',
540, 1050, 1980, 2490, '2024-05-02', 1)
;